FILES/Documents/СогласованиеКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СогласованиеКомандировки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТекущиеСогласования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Comment>Результат выполнения задания после завершения бизнес-процесса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Comment>Фактическая дата завершения бизнес-процесса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Описание задания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Командируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаСогласования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УсловияСогласованияКомандировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

FILES/InformationRegisters/ТекущиеСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Командируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Documents/СогласованиеКомандировки/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Начало");
	//
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Начало");
	//	

	Если НЕ МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Вместо") Тогда
		
		// регистр ТекущиеСогласования
		Движения.ТекущиеСогласования.Записывать = Истина;
		Движение = Движения.ТекущиеСогласования.Добавить();
		Движение.ОбъектСогласования = ОбъектСогласования;
		Движение.Командируемый = Командируемый;
		
	КонецЕсли;
	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Конец");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Начало");
	//
	Если НЕ МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Вместо") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ЭтотОбъект.ОбъектСогласования = ДанныеЗаполнения;
			
			//Найти актуальную схему
			Если ТипЗнч(ЭтотОбъект.ОбъектСогласования) = Тип("ДокументСсылка.Услуга") Тогда
				//
				ВхУслуга = ЭтотОбъект.ОбъектСогласования;
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("Партнер", 		ВхУслуга.Партнер);
				ПараметрыПоиска.Вставить("Контрагент", 		ВхУслуга.Контрагент);
				ПараметрыПоиска.Вставить("Договор", 		ВхУслуга.Договор);
				ПараметрыПоиска.Вставить("Командируемый", 	Справочники.Командированные.ПустаяСсылка());
				
				ЭтотОбъект.СхемаСогласования = УправлениеБТСервер.ПолучитьАктуальнуюСхемуСогласования(ПараметрыПоиска);
				
			ИначеЕсли ТипЗнч(ЭтотОбъект.ОбъектСогласования) = Тип("ДокументСсылка.ЗаказКомандированногоБТ") Тогда
				//
				ВхКомандировка = ЭтотОбъект.ОбъектСогласования;
				
				ЭтотОбъект.Командируемый = ВхКомандировка.Командированный;
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("Партнер", 		ВхКомандировка.Партнер);
				ПараметрыПоиска.Вставить("Контрагент", 		ВхКомандировка.Контрагент);
				ПараметрыПоиска.Вставить("Договор", 		ВхКомандировка.Договор);
				ПараметрыПоиска.Вставить("Командируемый", 	ВхКомандировка.Командированный);
				
				ЭтотОбъект.СхемаСогласования = УправлениеБТСервер.ПолучитьАктуальнуюСхемуСогласования(ПараметрыПоиска);
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Конец");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Начало");
	
	Если НЕ МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Вместо") Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Автор) Тогда
			ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
	КонецЕсли;

	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Конец");
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Конец");
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Конец");
КонецПроцедуры
